/*
 * Copyright (c) 2016 Andreas Werner <kernel@andy89.org>
 * 
 * Permission is hereby granted, free of charge, to any person 
 * obtaining a copy of this software and associated documentation 
 * files (the "Software"), to deal in the Software without restriction, 
 * including without limitation the rights to use, copy, modify, merge, 
 * publish, distribute, sublicense, and/or sell copies of the Software, 
 * and to permit persons to whom the Software is furnished to do so, 
 * subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included 
 * in all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS 
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL 
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER 
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING 
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS 
 * IN THE SOFTWARE.
 */
#include <FreeRTOS.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <system.h>
#include <semphr.h>
#include <hal.h>
#include <irq.h>
#include <queue.h>
#include <mailbox.h>
#include <vector.h>
#define MAILBOX_PRV
#include <mailbox_prv.h>
#include <ctrl.h>
#include <kconfig.h>
#include <os.h>
#define MBOX_IRQ_RX(id) BIT(id << 1)
#define MBOX_IRQ_TX(id) BIT((id << 1) + 1)
struct mailbox_irq {
	uint32_t IRQSTATUS_RAW; /* 0x0 */
	uint32_t IRQSTATUS_CLR; /* 0x4 */
	uint32_t IRQENABLE_SET; /* 0x8 */
	uint32_t IRQENABLE_CLR; /* 0xC */
};
struct mailbox_reg {
	uint32_t REVISION; /* 0x0 */
	uint32_t reserved_1[3]; /*0x4 - 0xC */

	uint32_t SYSCONFIG; /* 0x10 */
	uint32_t reserved_2[11]; /* 0x14 - 0x3C*/

	uint32_t MESSAGE[16]; /* 0x40 - 0x7C */
	uint32_t FIFOSTATUS[16]; /* 0x80 - 0xBC */
	uint32_t MSGSTATUS[16]; /* 0xC0 - 0xFC */

	volatile struct mailbox_irq irq[4]; /* 0x100 - 0x13C */

	uint32_t IRQ_EOI; /* 0x140 */
};
struct mailbox_contoller {
	struct mailbox_generic gen;
	volatile struct mailbox_reg *base;
	struct mailbox *mbox[16];
	uint32_t irq;
	const uint32_t irqBase;
	const uint32_t userID;
	void (*irqhandler)();
};
struct mailbox {
	struct mailbox_generic gen;
	struct mailbox_contoller *contoller;
	OS_DEFINE_SEMARPHORE_BINARAY(txsem);
	OS_DEFINE_QUEUE(rxqueue, 255, sizeof(uint32_t));
	bool full;
	const uint32_t id;
	const bool isRX;
};
MAILBOX_INIT(omap, index) {
	int32_t ret;
	struct mailbox *mbox = (struct mailbox *) MAILBOX_GET_DEV(index);
	struct mailbox_contoller *contoller;
	if (mbox == NULL) {
		goto omap_mailbox_init_error0;
	}
	contoller = mbox->contoller;
	ret = mailbox_genericInit(mbox);
	if (ret < 0) {
		goto omap_mailbox_init_error0;
	}
	/*
	 * Already Init
	 */
	if (ret > 0) {
		return mbox;
	}
	/* cast hear is ok */
	ret = mailbox_genericInit((struct mailbox *) mbox->contoller);
	if (ret < 0) {
		goto omap_mailbox_init_error0;
	}
