#include <timer.h>
#define TIMER_PRV
#include <timer_prv.h>
#include <pwm.h>
#define PWM_PRV
#include <pwm_prv.h>
#include <capture.h>
#define CAPTURE_PRV
#include <capture_prv.h>
#include <system.h>
#include <FreeRTOS.h>
#include <task.h>
#include <ctrl.h>
#include <irq.h>
#include <hal.h>
#include <vector.h>
#include <iomux.h>
#ifdef CONFIG_AM57xx_TIMER_DEBUG
# define PRINTF(fmt, ...) printf("TIMER: " fmt, ##__VA_ARGS__)
#else
# define PRINTF(fmt, ...)
#endif

#define TIMER_TIOCP_CFG_IDLEMODE(x) (((x) & 0x3) << 2)
#define TIMER_TIOCP_CFG_EMUFREE BIT(1)
#define TIMER_TIOCP_CFG_SOFTRESET BIT(0)

#define TIMER_IRQ_EOI_LINE_NUMBER BIT(0)

#define TIMER_IRQSTATUS_TCAR_IT_FLAG BIT(2)
#define TIMER_IRQSTATUS_OVF_IT_FLAG BIT(1)
#define TIMER_IRQSTATUS_MAT_IT_FLAG BIT(0)

#define TIMER_IRQWAKEEN_TCAR_WUP_ENA BIT(2)
#define TIMER_IRQWAKEEN_OVF_WUP_ENA BIT(1)
#define TIMER_IRQWAKEEN_MAT_WUP_ENA BIT(0)

#define TIMER_TCLR_GPO_CFG BIT(14)
#define TIMER_TCLR_CAPT_MODE BIT(13)
#define TIMER_TCLR_PT BIT(12)
#define TIMER_TCLR_TRG(x) (((x) & 0x3) << 10)
#define TIMER_TCLR_TCM(x) (((x) & 0x3) << 8)
#define TIMER_TCLR_SCPWM BIT(7)
#define TIMER_TCLR_CE BIT(6)
#define TIMER_TCLR_PRE BIT(5)
#define TIMER_TCLR_PTV(x) (((x) & 0x7) << 2)
#define TIMER_TCLR_AR BIT(1)
#define TIMER_TCLR_ST BIT(0)

#define TIMER_TWPS_W_PEND_TOWR BIT(9)
#define TIMER_TWPS_W_PEND_TOCR BIT(8)
#define TIMER_TWPS_W_PEND_TCVR BIT(7)
#define TIMER_TWPS_W_PEND_TNIR BIT(6)
#define TIMER_TWPS_W_PEND_TPIR BIT(5)
#define TIMER_TWPS_W_PEND_TMAR BIT(4)
#define TIMER_TWPS_W_PEND_TTGR BIT(3)
#define TIMER_TWPS_W_PEND_TLDR BIT(2)
#define TIMER_TWPS_W_PEND_TCRR BIT(1)
#define TIMER_TWPS_W_PEND_TCLR BIT(0)

#define TIMER_TSICR_READ_MODE BIT(3)
#define TIMER_TSICR_POSTED BIT(2)
#define TIMER_TSICR_SFT BIT(1)

struct timer_reg {
	uint32_t TIDR; /* 0x0 */
	uint32_t reserved1[3]; /* 0x4 - 0xC  */
	uint32_t TIOCP_CFG; /* 0x10 */
	uint32_t reserved2[3]; /* 0x14 - 0x1C */
	uint32_t IRQ_EOI; /* 0x20 */
	uint32_t IRQSTATUS_RAW; /* 0x24 */
	uint32_t IRQSTATUS; /* 0x28 */
	uint32_t IRQSTATUS_SET; /* 0x2C */
	uint32_t IRQSTATUS_CLR; /* 0x30 */
	uint32_t IRQWAKEEN; /* 0x34 */
	uint32_t TCLR; /* 0x38 */
	uint32_t TCRR; /* 0x3C */
	uint32_t TLDR; /* 0x40 */
	uint32_t TTGR; /* 0x44 */
	uint32_t TWPS; /* 0x48 */
	uint32_t TMAR; /* 0x4C */
	uint32_t TCAR1; /* 0x50 */
	uint32_t TSICR; /* 0x54 */
	uint32_t TCAR2; /* 0x58 */
	uint32_t TPIR; /* 0x5C */
	uint32_t TNIR; /* 0x60 */
	uint32_t TCVR; /* 0x64 */
	uint32_t TOCR; /* 0x68 */
	uint32_t TOWR; /* 0x6C */
};
struct timer {
	struct timer_generic gen;
	uint64_t basetime;
	int64_t adjust;
	uint32_t prescaler;
	bool (*callback)(struct timer *timer, void *data);
	void *data;
	uint32_t irq;
	bool periodic;

	volatile struct timer_reg *base;
	volatile uint32_t *clkbase;
	uint32_t irqBase;
	void (*irqHandler)();
#ifdef CONFIG_AM57xx_TIMER_CAPTURE
	struct capture *capture;
#endif
};
TIMER_INIT(am57xx, index, prescaler, basetime, adjust) {
	uint32_t reg;
	int32_t ret;
	struct timer *timer;;
	timer = TIMER_GET_DEV(index);
	if (timer == NULL) {
		goto am57xx_timer_init_error0;
	}
	ret = timer_generic_init(timer);
	if (ret < 0) {
		goto am57xx_timer_init_error0;
	}
	if (ret > 0) {
		goto am57xx_timer_init_exit;
	}
	if (prescaler == 0) {
		goto am57xx_timer_init_error1;
	}
	PRINTF("prescaler: %lu basetime: %llu adjust: %lld\n", prescaler, basetime, adjust);
	timer->prescaler = prescaler;
	timer->basetime = basetime;
	timer->adjust = adjust;
	/* Check Clock is enabled */
