/* SPDX-License-Identifier: MIT */
/*
 * Author: Andreas Werner <kernel@andy89.org>
 * Date: 2020
 */
#ifndef NXP_FLEXCAN_H_
#define NXP_FLEXCAN_H_
#include <stdint.h>
#ifndef CAN_PRV
# error CAN_PRV not defined
#endif
#include <can.h>
#include <gpio.h>

/* Structure of the message buffer */
struct flexcan_mb {
	uint32_t ctrl;
	uint32_t id;
	uint32_t data[2]; /* resize if CAN FD is used */
};

/* Structure of the hardware registers */
struct flexcan_regs {
	uint32_t mcr;		/* 0x0 Module Configuration register (MCR) */
	uint32_t ctrl1;		/* 0x4 Control 1 register (CTRL1) */
	uint32_t timer;		/* 0x8 Free Running Timer (TIMER) */
	uint32_t _reserved1;	/* 0x0c */
	union {
		uint32_t rxgmask;	/* 0x10 */
		uint32_t rxmgmask;	/* 0x10 Rx Mailboxes Global Mask register (RXMGMASK) */
	};
	uint32_t rx14mask;	/* 0x14 Rx 14 Mask register (RX14MASK) */
	uint32_t rx15mask;	/* 0x18 Rx 15 Mask register (RX15MASK) */
	uint32_t ecr;		/* 0x1C Error Counter (ECR) */
	union {
		uint32_t esr;		/* 0x20 */
		uint32_t esr1;		/* 0x20 Error and Status 1 register (ESR1) */
	};
	uint32_t imask2;	/* 0x24 */ /* not in S32k */
	uint32_t imask1;	/* 0x28 Interrupt Masks 1 register (IMASK1) */
	uint32_t iflag2;	/* 0x2c */ /* not in S32k */
	uint32_t iflag1;	/* 0x30 Interrupt Flags 1 register (IFLAG1) */
	union {			/* 0x34 */
		uint32_t gfwr_mx28; /* MX28, MX53 */
		uint32_t ctrl2;	/* 0x34 Control 2 register (CTRL2) */ /* MX6, VF610, S32k */
	};
	uint32_t esr2;		/* 0x38 Error and Status 2 register (ESR2) */
	uint32_t imeur;		/* 0x3c */ /* not in S32k */
	uint32_t lrfr;		/* 0x40 */ /* not in S32k */
	uint32_t crcr;		/* 0x44 CRC register (CRCR) */
	uint32_t rxfgmask;	/* 0x48 Rx FIFO Global Mask register (RXFGMASK) */
	uint32_t rxfir;		/* 0x4C Rx FIFO Information register (RXFIR) */
	uint32_t cbt;		/* 0x50 CAN Bit Timing register (CBT) */
	uint32_t _reserved3[11];/* 0x54 */
	/* we use the first MB as send MB all other MB are recv MBs */
	struct flexcan_mb mb[32]; /* 0x80 */
	struct flexcan_mb mb2[32];/* 0x200 only use if hw has 64 MBs */
	uint32_t _reserved4[256];	/* 0x480 */
	uint32_t rximr[64];		/* 0x880 Rx Individual Mask registers (RXIMR0 - RXIMR31) */
	uint32_t _reserved5[24];	/* 0x980 */
	uint32_t gfwr_mx6;		/* 0x9e0 - MX6 */ /* not in S32k */
	uint32_t _reserved6[63];	/* 0x9e4 */
	 /* not in S32k - start*/
	uint32_t mecr;			/* 0xae0 */
	uint32_t erriar;		/* 0xae4 */
	uint32_t erridpr;		/* 0xae8 */
	uint32_t errippr;		/* 0xaec */
	uint32_t rerrar;		/* 0xaf0 */
	uint32_t rerrdr;		/* 0xaf4 */
	uint32_t rerrsynr;		/* 0xaf8 */
	uint32_t errsr;			/* 0xafc */
	/* not in S32k - end */
	/* only on S32k - start */
	uint32_t ctrl1_pn;		/* 0xB00 Pretended Networking Control 1 register (CTRL1_PN) */
	uint32_t ctrl2_pn;		/* 0xB04 Pretended Networking Control 2 register (CTRL2_PN) */
	uint32_t wu_mtc;		/* 0xB08 Pretended Networking Wake Up Match register (WU_MTC) */
	uint32_t flt_id1;		/* 0xB0C Pretended Networking ID Filter 1 register (FLT_ID1) */
	uint32_t flt_dlc;		/* 0xB10 Pretended Networking DLC Filter register (FLT_DLC) */
	uint32_t pl1_lo;		/* 0xB14 Pretended Networking Payload Low Filter 1 register (PL1_LO) */
	uint32_t pl1_hi;		/* 0xB18 Pretended Networking Payload High Filter 1 register (PL1_HI) */
	uint32_t flt_id2_idmask;	/* 0xB1C Pretended Networking ID Filter 2 Register / ID Mask register (FLT_ID2_IDMASK) */
	uint32_t pl2_plmask_lo;		/* 0xB20 Pretended Networking Payload Low Filter 2 Register / Payload Low Mask register (PL2_PLMASK_LO) */
	uint32_t pl2_plmask_hi;		/* 0xB24 Pretended Networking Payload High Filter 2 low order bits / Payload High Mask register (PL2_PLMASK_HI) */
	uint32_t reserverd7[6];		/* 0xB28 - 0xB3C */
	uint32_t wmb0_cs;		/* 0xB40 Wake Up Message Buffer register for C/S (WMB0_CS) */
	uint32_t wmb0_id;		/* 0xB44 Wake Up Message Buffer Register for ID (WMB0_ID) */
	uint32_t wmb0_d03;		/* 0xB48 Wake Up Message Buffer Register for Data 0-3 (WMB0_D03) */
	uint32_t wmb0_d47;		/* 0xB4C Wake Up Message Buffer Register Data 4-7 (WMB0_D47) */
	uint32_t wmb1_cs;		/* 0xB50 Wake Up Message Buffer register for C/S (WMB1_CS) */
	uint32_t wmb1_id;		/* 0xB54 Wake Up Message Buffer Register for ID (WMB1_ID) */
	uint32_t wmb1_d03;		/* 0xB58 Wake Up Message Buffer Register for Data 0-3 (WMB1_D03) */
	uint32_t wmb1_d47;		/* 0xB5C Wake Up Message Buffer Register Data 4-7 (WMB1_D47) */
	uint32_t wmb2_cs;		/* 0xB60 Wake Up Message Buffer register for C/S (WMB2_CS) */
	uint32_t wmb2_id;		/* 0xB64 Wake Up Message Buffer Register for ID (WMB2_ID) */
	uint32_t wmb2_d03;		/* 0xB68 Wake Up Message Buffer Register for Data 0-3 (WMB2_D03) */
	uint32_t wmb2_d47;		/* 0xB6C Wake Up Message Buffer Register Data 4-7 (WMB2_D47) */
	uint32_t wmb3_cs;		/* 0xB70 Wake Up Message Buffer register for C/S (WMB3_CS) */
	uint32_t wmb3_id;		/* 0xB74 Wake Up Message Buffer Register for ID (WMB3_ID) */
	uint32_t wmb3_d03;		/* 0xB78 Wake Up Message Buffer Register for Data 0-3 (WMB3_D03) */
	uint32_t wmb3_d47;		/* 0xB7C Wake Up Message Buffer Register Data 4-7 (WMB3_D47) */
	uint32_t reserverd8[32];	/* 0xB80-0xBFC */
	uint32_t fdctrl;		/* 0xC00 CAN FD Control register (FDCTRL) */
	uint32_t fdcbt;			/* 0xC04 CAN FD Bit Timing register (FDCBT) */
	uint32_t fdcrc;			/* 0xC08 CAN FD CRC register (FDCRC) */
	/* only on S32k - end */
};

struct flexcan_filter {
	bool used;
	struct can_filter filter;
	uint32_t id;
	bool (*callback)(struct can *can, struct can_msg *msg, void *data);
	void *data;
	OS_DEFINE_QUEUE(queue, CONFIG_MACH_S32K_FLEXCAN_CAN0_FILTER_QUEUE_ENTRIES, sizeof(struct can_msg));
};

struct can {
	struct can_generic gen;
	void const *clkData;
	void const *pins;
	volatile struct flexcan_regs *base;
	struct can_bittiming_const const *btc;
	const uint32_t filterLength;
	const uint32_t filterCount;
	const uint32_t irqIDs[5];
	const uint32_t irqNum;
	struct gpio_pin *enablePin;
	bool pinHigh;
	bool up;
	struct can_bittiming bt;
	int64_t freq;
	uint32_t mb_count;
	TaskHandle_t task;
	bool (*errorCallback)(struct can *can, can_error_t error, can_errorData_t data, void *userData);
	void *userData;
	struct flexcan_filter *filter;
};
int32_t flexcan_setupClock(struct can *can);
int32_t flexcan_setupPins(struct can *can);
